---
type: StructuralSectionCProfileWithFold
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 1
tags: [revit-api, class]
---

# StructuralSectionCProfileWithFold

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfileWithFold` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionCProfileWithFold | 2016 | `public StructuralSectionCProfileWithFold ( double width , double height , double wallNominalThickness , double wallDesignThickness , double innerFillet , double centroidHorizontal , double centroidVertical , double princ` |